In [68]:
import pandas as pd
import numpy as np

df = pd.read_csv('./data/train.csv')

In [69]:
df.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S

In [70]:
df = df.drop(['Name', 'Ticket', 'Cabin'], axis=1)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 9 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Fare           891 non-null float64
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(2)

In [71]:
df = df.dropna()
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 9 columns):
PassengerId    712 non-null int64
Survived       712 non-null int64
Pclass         712 non-null int64
Sex            712 non-null object
Age            712 non-null float64
SibSp          712 non-null int64
Parch          712 non-null int64
Fare           712 non-null float64
Embarked       712 non-null object
dtypes: float64(2), int64(5), object(2)

In [72]:
df['Gender'] = df['Sex'].map({'female': 1, 'male':0}).astype(int)
df['Port'] = df['Embarked'].map({'C':1, 'S':2, 'Q':3}).astype(int)
df = df.drop(['Sex', 'Embarked'], axis=1)

In [73]:
cols = df.columns.tolist()
print(cols)

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Gender', 'Port']

In [74]:
cols = [cols[1]] + cols[0:1] + cols[2:]
df = df[cols]

In [75]:
print(df.head(4))
df.info()

   Survived  PassengerId  Pclass  Age  SibSp  Parch     Fare  Gender  Port
0         0            1       3   22      1      0   7.2500       0     2
1         1            2       1   38      1      0  71.2833       1     1
2         1            3       3   26      0      0   7.9250       1     2
3         1            4       1   35      1      0  53.1000       1     2

[4 rows x 9 columns]
<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 9 columns):
Survived       712 non-null int64
PassengerId    712 non-null int64
Pclass         712 non-null int64
Age            712 non-null float64
SibSp          712 non-null int64
Parch          712 non-null int64
Fare           712 non-null float64
Gender         712 non-null int64
Port           712 non-null int64
dtypes: float64(2), int64(7)

In [76]:
train_data1 = df.drop(['Survived', 'PassengerId'], axis=1)
target1 = df.Survived
train_data = df.drop(['Survived', 'PassengerId'], axis=1).values
target = df.Survived.values

In [77]:
from sklearn.ensemble import RandomForestClassifier

model = RandomForestClassifier(n_estimators = 100)

In [78]:
model = model.fit(train_data, target)

### Now we start predicting our model

In [79]:
df_test = pd.read_csv('./data/test.csv')
df_test.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [80]:
df_test = df_test.drop(['Name', 'Ticket', 'Cabin'], axis=1)

#df_test = df_test.dropna()

df_test['Gender'] = df_test['Sex'].map({'female': 0, 'male':1})
df_test['Port'] = df_test['Embarked'].map({'C':1, 'S':2, 'Q':3})

df_test = df_test.drop(['Sex', 'Embarked', 'PassengerId'], axis=1)

In [81]:
print(df_test.info())
age_mean = int(df_test['Age'].median())
print()
print(age_mean)
df_test['Age'] = df_test['Age'].fillna(age_mean)
df_test['Fare'] = df_test['Fare'].fillna(df_test['Fare'].mean())
#train1.Age[train1.Age.isnull()]
print("After")
print(df_test.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 0 to 417
Data columns (total 7 columns):
Pclass    418 non-null int64
Age       332 non-null float64
SibSp     418 non-null int64
Parch     418 non-null int64
Fare      417 non-null float64
Gender    418 non-null int64
Port      418 non-null int64
dtypes: float64(2), int64(5)None

27
After
<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 0 to 417
Data columns (total 7 columns):
Pclass    418 non-null int64
Age       418 non-null float64
SibSp     418 non-null int64
Parch     418 non-null int64
Fare      418 non-null float64
Gender    418 non-null int64
Port      418 non-null int64
dtypes: float64(2), int64(5)None

In [82]:
print(age_mean)
df_test.head()
test_data = df_test.values

27

In [83]:
df_test.head(11)

    Pclass   Age  SibSp  Parch     Fare  Gender  Port
0        3  34.5      0      0   7.8292       1     3
1        3  47.0      1      0   7.0000       0     2
2        2  62.0      0      0   9.6875       1     3
3        3  27.0      0      0   8.6625       1     2
4        3  22.0      1      1  12.2875       0     2
5        3  14.0      0      0   9.2250       1     2
6        3  30.0      0      0   7.6292       0     3
7        2  26.0      1      1  29.0000       1     2
8        3  18.0      0      0   7.2292       0     1
9        3  21.0      2      0  24.1500       1     2
10       3  27.0      0      0   7.8958       1     2

[11 rows x 7 columns]

In [84]:
output = model.predict(test_data)

In [85]:
test = pd.read_csv('./data/test.csv')
test1
pid = test.PassengerId.values
result = np.c_[pid.astype(int), output.astype(int)]

In [86]:
df_result = pd.DataFrame(result, columns=['PassengerId', 'Survived'])
df_result.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         1
3          895         1
4          896         0

[5 rows x 2 columns]

In [87]:
df_result.to_csv('./titanic_1-1-best.csv', index=False)

In [24]:
import nolearn
from nolearn.dbn import DBN
net = DBN(
    [7, 5, 2],
    learn_rates=0.3,
    learn_rate_decays=0.9,
    epochs=10,
    verbose=0,
    )
net.fit(train_data, target)

SyntaxError: invalid syntax (dbn.py, line 257)

In [89]:
target1.to_csv('./target.csv', index=False)
train_data1.to_csv('./train_data.csv', index=False)
df_test.to_csv('./test_data.csv', index=False)

In [91]:
output = [0 for i in range(418)]
result11 = np.c_[pid.astype(int), output]
df_result11 = pd.DataFrame(result11, columns=['PassengerId', 'Survived'])
df_result11.to_csv('./titanic_1-neural-best.csv', index=False)